# Importando base de dados

In [47]:
import pandas as pd 
import seaborn as sns

In [48]:
dados = pd.read_csv('data/tips.csv')

In [49]:
dados.head()

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4

# Traduzindo Colunas e campos

In [50]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [51]:
renomear = {
    'total_bill':'valor_da_conta',
    'tip':'gorjeta',
    'dessert':'sobremesa',
    'day':'dia_da_semana',
    'time':'hora_do_dia', 
    'size':'total_de_pessoas'
}

In [52]:
type(dados)

pandas.core.frame.DataFrame

In [53]:
gorjetas = dados.rename(columns=renomear)

In [54]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,No,Sun,Dinner,2

In [55]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [56]:
sim_nao = {
    'No': 'Não', 
    'Yes' : 'Sim'

}

In [57]:
gorjetas.sobremesa.map(sim_nao)

0      Não
1      Não
2      Não
3      Não
4      Não
      ...
239    Não
240    Sim
241    Sim
242    Não
243    Não
Name: sobremesa, Length: 244, dtype: object

In [58]:
gorjetas.sobremesa = gorjetas.sobremesa.map(sim_nao)

In [60]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Sun,Dinner,2

In [61]:
gorjetas.dia_da_semana.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [62]:
dias = {

    'Sun':'Domingo',
    'Sat':'Sábado',
    'Thur':'Quinta',
    'Fri':'Sexta'
}

In [64]:
gorjetas.dia_da_semana = gorjetas.dia_da_semana.map(dias)

In [71]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Domingo,Dinner,2

In [72]:
gorjetas.dia_da_semana.unique()

array(['Domingo', 'Sábado', 'Quinta', 'Sexta'], dtype=object)

In [73]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [75]:
horario = {
    'Dinner':'Jantar',
     'Lunch':'Almoço'
}

In [76]:
gorjetas.hora_do_dia.map(horario)

0      Jantar
1      Jantar
2      Jantar
3      Jantar
4      Jantar
        ...
239    Jantar
240    Jantar
241    Jantar
242    Jantar
243    Jantar
Name: hora_do_dia, Length: 244, dtype: object

In [77]:
gorjetas.hora_do_dia = gorjetas.hora_do_dia.map(horario)

In [78]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,Não,Domingo,Jantar,2

# teste